app/controllers/fnbl_users_controller.rb

  def index
    @fnbl_users = FnblUser.all
---
SELECT `fnbl_users`.* FROM `fnbl_users`

  def create
    @fnbl_user = FnblUser.new
    fnbl_user_tmp1 = params[:fnbl_user]
    @fnbl_user.username = fnbl_user_tmp1[:username]
    @fnbl_user.password = `php #{Rails.root}/public/encrypt_password.php #{fnbl_user_tmp1[:password]}`
    @fnbl_user.email = fnbl_user_tmp1[:email]
    @fnbl_user.first_name = fnbl_user_tmp1[:first_name]
    @fnbl_user.last_name = fnbl_user_tmp1[:last_name]
    @fnbl_user_role = @fnbl_user.fnbl_user_roles.build(:role=>"sync_user")

    respond_to do |format|
      if @fnbl_user.save
---
INSERT INTO `fnbl_user_role` (`role`, `username`) VALUES ('sync_user', 'test2')
INSERT INTO `fnbl_user` (`email`, `first_name`, `last_name`, `password`) VALUES ('ralph4@rwort.co.uk', 'rw4firstname', 'rw4lastame', 'rw4password')

  def update
    @fnbl_user = FnblUser.find(params[:id])

    respond_to do |format|
      if @fnbl_user.update_attributes(params[:fnbl_user])
---
UPDATE `fnbl_user` SET `last_name` = 'rw2 last name' WHERE `fnbl_user`.`username` = 'rw2'