app/controllers/fnbl_user_roles_controller.rb

  def index
    @fnbl_user_roles = FnblUserRole.all
---
SELECT `fnbl_user_role`.* FROM `fnbl_user_role`

  def create
    @fnbl_user_role = FnblUserRole.new(params[:fnbl_user_role])

    @fnbl_user_role = FnblUserRole.new
    fnbl_user_role_tmp1 = params[:fnbl_user_role]
    @fnbl_user_role.username = fnbl_user_role_tmp1[:username]
    @fnbl_user_role.role = fnbl_user_role_tmp1[:role]

    respond_to do |format|
      if @fnbl_user_role.save
---
INSERT INTO `fnbl_user_role` (`role`, `username`) VALUES ('sync_user', 'rw4')