app/controllers/fnbl_tel_nos_controller.rb

SELECT `fnbl_tel_nos`.* FROM `fnbl_tel_nos` WHERE (userid = 'vodafone')
---
  def index
    @fnbl_tel_nos = FnblTelNo.where("userid = '" + params[:username] + "'")