app/controllers/fnbl_pim_contacts_controller.rb

SELECT `fnbl_pim_contact`.* FROM `fnbl_pim_contact` WHERE (userid = 'vodafone')
---
  def index
    @fnbl_pim_contacts = FnblPimContact.where("userid = '" + params[:username] + "'")

SELECT `fnbl_pim_contact`.* FROM `fnbl_pim_contact` WHERE `fnbl_pim_contact`.`id` = 0 LIMIT 1
---
  def show
    @fnbl_pim_contact = FnblPimContact.find(params[:id])