app/controllers/fnbl_pim_contact_items_controller.rb

  def index
    @fnbl_pim_contact_items = FnblPimContactItem.all
---
SELECT `fnbl_pim_contact_item`.* FROM `fnbl_pim_contact_item`

  def show
    @fnbl_pim_contact_item = FnblPimContactItem.find(params[:id])
---
SELECT `fnbl_pim_contact_item`.* FROM `fnbl_pim_contact_item` WHERE `fnbl_pim_contact_item`.`contact` = 0 AND `fnbl_pim_contact_item`.`type` = 1