app/controllers/get_tel_nos_controller.rb

  def get_tel_nos
    @fnbl_pim_contact = FnblPimContact.all
---
SELECT `fnbl_pim_contact`.* FROM `fnbl_pim_contact`