app/views/fnbl_pim_contacts/index.html.erb

<% @fnbl_pim_contacts.each do |fnbl_pim_contact| %>
  <% fnbl_pim_contact.fnbl_pim_contact_items.each do |fnbl_pim_contact_item|%>
---
SELECT `fnbl_pim_contact`.* FROM `fnbl_pim_contact` WHERE (userid = 'vodafone')